MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4585/mcu.h
extern volatile B4SIDHbits_t B4SIDHbits __at(0xE61);
// bitfield macros
#define _B4SIDH_SID3_POSN                                   0x0
#define _B4SIDH_SID3_POSITION                               0x0
#define _B4SIDH_SID3_SIZE                                   0x1
#define _B4SIDH_SID3_LENGTH                                 0x1
#define _B4SIDH_SID3_MASK                                   0x1
#define _B4SIDH_SID4_POSN                                   0x1
#define _B4SIDH_SID4_POSITION                               0x1
#define _B4SIDH_SID4_SIZE                                   0x1
#define _B4SIDH_SID4_LENGTH                                 0x1
#define _B4SIDH_SID4_MASK                                   0x2
#define _B4SIDH_SID5_POSN                                   0x2
#define _B4SIDH_SID5_POSITION                               0x2
#define _B4SIDH_SID5_SIZE                                   0x1
#define _B4SIDH_SID5_LENGTH                                 0x1
#define _B4SIDH_SID5_MASK                                   0x4
#define _B4SIDH_SID6_POSN                                   0x3
#define _B4SIDH_SID6_POSITION                               0x3
#define _B4SIDH_SID6_SIZE                                   0x1
#define _B4SIDH_SID6_LENGTH                                 0x1
#define _B4SIDH_SID6_MASK                                   0x8
#define _B4SIDH_SID7_POSN                                   0x4
#define _B4SIDH_SID7_POSITION                               0x4
#define _B4SIDH_SID7_SIZE                                   0x1
#define _B4SIDH_SID7_LENGTH                                 0x1
#define _B4SIDH_SID7_MASK                                   0x10
#define _B4SIDH_SID8_POSN                                   0x5
#define _B4SIDH_SID8_POSITION                               0x5
#define _B4SIDH_SID8_SIZE                                   0x1
#define _B4SIDH_SID8_LENGTH                                 0x1
#define _B4SIDH_SID8_MASK                                   0x20
#define _B4SIDH_SID9_POSN                                   0x6
#define _B4SIDH_SID9_POSITION                               0x6
#define _B4SIDH_SID9_SIZE                                   0x1
#define _B4SIDH_SID9_LENGTH                                 0x1
#define _B4SIDH_SID9_MASK                                   0x40
#define _B4SIDH_SID10_POSN                                  0x7
#define _B4SIDH_SID10_POSITION                              0x7
#define _B4SIDH_SID10_SIZE                                  0x1
#define _B4SIDH_SID10_LENGTH                                0x1
#define _B4SIDH_SID10_MASK                                  0x80
#define _B4SIDH_B4SID3_POSN                                 0x0
#define _B4SIDH_B4SID3_POSITION                             0x0
#define _B4SIDH_B4SID3_SIZE                                 0x1
#define _B4SIDH_B4SID3_LENGTH                               0x1
#define _B4SIDH_B4SID3_MASK                                 0x1
#define _B4SIDH_B4SID4_POSN                                 0x1
#define _B4SIDH_B4SID4_POSITION                             0x1
#define _B4SIDH_B4SID4_SIZE                                 0x1
#define _B4SIDH_B4SID4_LENGTH                               0x1
#define _B4SIDH_B4SID4_MASK                                 0x2
#define _B4SIDH_B4SID5_POSN                                 0x2
#define _B4SIDH_B4SID5_POSITION                             0x2
#define _B4SIDH_B4SID5_SIZE                                 0x1
#define _B4SIDH_B4SID5_LENGTH                               0x1
#define _B4SIDH_B4SID5_MASK                                 0x4
#define _B4SIDH_B4SID6_POSN                                 0x3
#define _B4SIDH_B4SID6_POSITION                             0x3
#define _B4SIDH_B4SID6_SIZE                                 0x1
#define _B4SIDH_B4SID6_LENGTH                               0x1
#define _B4SIDH_B4SID6_MASK                                 0x8
#define _B4SIDH_B4SID7_POSN                                 0x4
#define _B4SIDH_B4SID7_POSITION                             0x4
#define _B4SIDH_B4SID7_SIZE                                 0x1
#define _B4SIDH_B4SID7_LENGTH                               0x1
#define _B4SIDH_B4SID7_MASK                                 0x10
#define _B4SIDH_B4SID8_POSN                                 0x5
#define _B4SIDH_B4SID8_POSITION                             0x5
#define _B4SIDH_B4SID8_SIZE                                 0x1
#define _B4SIDH_B4SID8_LENGTH                               0x1
#define _B4SIDH_B4SID8_MASK                                 0x20
#define _B4SIDH_B4SID9_POSN                                 0x6
#define _B4SIDH_B4SID9_POSITION                             0x6
#define _B4SIDH_B4SID9_SIZE                                 0x1
#define _B4SIDH_B4SID9_LENGTH                               0x1
#define _B4SIDH_B4SID9_MASK                                 0x40
#define _B4SIDH_B4SID10_POSN                                0x7
#define _B4SIDH_B4SID10_POSITION                            0x7
#define _B4SIDH_B4SID10_SIZE                                0x1
#define _B4SIDH_B4SID10_LENGTH                              0x1
#define _B4SIDH_B4SID10_MASK                                0x80

// Register: B4SIDL
#define B4SIDL B4SIDL
extern volatile unsigned char           B4SIDL              __at(0xE62);
#ifndef _LIB_BUILD
asm("B4SIDL equ 0E62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned SRR                    :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXID                   :1;
    };
    struct {
        unsigned B4EID16                :1;
        unsigned B4EID17                :1;
        unsigned                        :1;
        unsigned B4EXID                 :1;
        unsigned B4SRR                  :1;
        unsigned B4SID0                 :1;
        unsigned B4SID1                 :1;
        unsigned B4SID2                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned B4EXIDE                :1;
    };
} B4SIDLbits_t;
extern volatile B4SIDLbits_t B4SIDLbits __at(0xE62);
// bitfield macros
#define _B4SIDL_EID16_POSN                                  0x0
#define _B4SIDL_EID16_POSITION                              0x0
#define _B4SIDL_EID16_SIZE                                  0x1
#define _B4SIDL_EID16_LENGTH                                0x1
#define _B4SIDL_EID16_MASK                                  0x1
#define _B4SIDL_EID17_POSN                                  0x1
#define _B4SIDL_EID17_POSITION                              0x1
#define _B4SIDL_EID17_SIZE                                  0x1
#define _B4SIDL_EID17_LENGTH                                0x1
#define _B4SIDL_EID17_MASK                                  0x2
#define _B4SIDL_EXIDE_POSN                                  0x3
#define _B4SIDL_EXIDE_POSITION                              0x3
#define _B4SIDL_EXIDE_SIZE                                  0x1
#define _B4SIDL_EXIDE_LENGTH                                0x1
#define _B4SIDL_EXIDE_MASK                                  0x8
#define _B4SIDL_SRR_POSN                                    0x4
#define _B4SIDL_SRR_POSITION                                0x4
#define _B4SIDL_SRR_SIZE                                    0x1
#define _B4SIDL_SRR_LENGTH                                  0x1
#define _B4SIDL_SRR_MASK                                    0x10
#define _B4SIDL_SID0_POSN                                   0x5
#define _B4SIDL_SID0_POSITION                               0x5
#define _B4SIDL_SID0_SIZE                                   0x1
#define _B4SIDL_SID0_LENGTH                                 0x1
#define _B4SIDL_SID0_MASK                                   0x20
#define _B4SIDL_SID1_POSN                                   0x6
#define _B4SIDL_SID1_POSITION                               0x6
#define _B4SIDL_SID1_SIZE                                   0x1
#define _B4SIDL_SID1_LENGTH                                 0x1
#define _B4SIDL_SID1_MASK                                   0x40
#define _B4SIDL_SID2_POSN                                   0x7
#define _B4SIDL_SID2_POSITION                               0x7
#define _B4SIDL_SID2_SIZE                                   0x1
#define _B4SIDL_SID2_LENGTH                                 0x1
#define _B4SIDL_SID2_MASK                                   0x80
#define _B4SIDL_EXID_POSN                                   0x3
#define _B4SIDL_EXID_POSITION                               0x3
#define _B4SIDL_EXID_SIZE                                   0x1
#define _B4SIDL_EXID_LENGTH                                 0x1
#define _B4SIDL_EXID_MASK                                   0x8
#define _B4SIDL_B4EID16_POSN                                0x0
#define _B4SIDL_B4EID16_POSITION                            0x0
#define _B4SIDL_B4EID16_SIZE                                0x1
#define _B4SIDL_B4EID16_LENGTH                              0x1
#define _B4SIDL_B4EID16_MASK                                0x1
#define _B4SIDL_B4EID17_POSN                                0x1
#define _B4SIDL_B4EID17_POSITION                            0x1
#define _B4SIDL_B4EID17_SIZE                                0x1
#define _B4SIDL_B4EID17_LENGTH                              0x1
#define _B4SIDL_B4EID17_MASK                                0x2
#define _B4SIDL_B4EXID_POSN                                 0x3
#define _B4SIDL_B4EXID_POSITION                             0x3
#define _B4SIDL_B4EXID_SIZE                                 0x1
#define _B4SIDL_B4EXID_LENGTH                               0x1
#define _B4SIDL_B4EXID_MASK                                 0x8
#define _B4SIDL_B4SRR_POSN                                  0x4
#define _B4SIDL_B4SRR_POSITION                              0x4
#define _B4SIDL_B4SRR_SIZE                                  0x1
#define _B4SIDL_B4SRR_LENGTH                                0x1
#define _B4SIDL_B4SRR_MASK                                  0x10
#define _B4SIDL_B4SID0_POSN                                 0x5
#define _B4SIDL_B4SID0_POSITION                             0x5
#define _B4SIDL_B4SID0_SIZE                                 0x1
#define _B4SIDL_B4SID0_LENGTH                               0x1
#define _B4SIDL_B4SID0_MASK                                 0x20
#define _B4SIDL_B4SID1_POSN                                 0x6
#define _B4SIDL_B4SID1_POSITION                             0x6
#define _B4SIDL_B4SID1_SIZE                                 0x1
#define _B4SIDL_B4SID1_LENGTH                               0x1
#define _B4SIDL_B4SID1_MASK                                 0x40
#define _B4SIDL_B4SID2_POSN                                 0x7
#define _B4SIDL_B4SID2_POSITION                             0x7
#define _B4SIDL_B4SID2_SIZE                                 0x1
#define _B4SIDL_B4SID2_LENGTH                               0x1
#define _B4SIDL_B4SID2_MASK                                 0x80
#define _B4SIDL_B4EXIDE_POSN                                0x3
#define _B4SIDL_B4EXIDE_POSITION                            0x3
#define _B4SIDL_B4EXIDE_SIZE                                0x1
#define _B4SIDL_B4EXIDE_LENGTH                              0x1
#define _B4SIDL_B4EXIDE_MASK                                0x8

// Register: B4EIDH
#define B4EIDH B4EIDH
extern volatile unsigned char           B4EIDH              __at(0xE63);
#ifndef _LIB_BUILD
asm("B4EIDH equ 0E63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B4EID8                 :1;
        unsigned B4EID9                 :1;
        unsigned B4EID10                :1;
        unsigned B4EID11                :1;
        unsigned B4EID12                :1;
        unsigned B4EID13                :1;
        unsigned B4EID14                :1;
        unsigned B4EID15                :1;
    };
} B4EIDHbits_t;
extern volatile B4EIDHbits_t B4EIDHbits __at(0xE63);
// bitfield macros
#define _B4EIDH_EID8_POSN                                   0x0
#define _B4EIDH_EID8_POSITION                               0x0
#define _B4EIDH_EID8_SIZE                                   0x1
#define _B4EIDH_EID8_LENGTH                                 0x1
#define _B4EIDH_EID8_MASK                                   0x1
#define _B4EIDH_EID9_POSN                                   0x1
#define _B4EIDH_EID9_POSITION                               0x1
#define _B4EIDH_EID9_SIZE                                   0x1
#define _B4EIDH_EID9_LENGTH                                 0x1
#define _B4EIDH_EID9_MASK                                   0x2
#define _B4EIDH_EID10_POSN                                  0x2
#define _B4EIDH_EID10_POSITION                              0x2
#define _B4EIDH_EID10_SIZE                                  0x1
#define _B4EIDH_EID10_LENGTH                                0x1
#define _B4EIDH_EID10_MASK                                  0x4
#define _B4EIDH_EID11_POSN                                  0x3
#define _B4EIDH_EID11_POSITION                              0x3
#define _B4EIDH_EID11_SIZE                                  0x1
#define _B4EIDH_EID11_LENGTH                                0x1
#define _B4EIDH_EID11_MASK                                  0x8
#define _B4EIDH_EID12_POSN                                  0x4
#define _B4EIDH_EID12_POSITION                              0x4
#define _B4EIDH_EID12_SIZE                                  0x1
#define _B4EIDH_EID12_LENGTH                                0x1
#define _B4EIDH_EID12_MASK                                  0x10
#define _B4EIDH_EID13_POSN                                  0x5
#define _B4EIDH_EID13_POSITION                              0x5
#define _B4EIDH_EID13_SIZE                                  0x1
#define _B4EIDH_EID13_LENGTH                                0x1
#define _B4EIDH_EID13_MASK                                  0x20
#define _B4EIDH_EID14_POSN                                  0x6
#define _B4EIDH_EID14_POSITION                              0x6
#define _B4EIDH_EID14_SIZE                                  0x1
#define _B4EIDH_EID14_LENGTH                                0x1
#define _B4EIDH_EID14_MASK                                  0x40
#define _B4EIDH_EID15_POSN                                  0x7
#define _B4EIDH_EID15_POSITION                              0x7
#define _B4EIDH_EID15_SIZE                                  0x1
#define _B4EIDH_EID15_LENGTH                                0x1
#define _B4EIDH_EID15_MASK                                  0x80
#define _B4EIDH_B4EID8_POSN                                 0x0
#define _B4EIDH_B4EID8_POSITION                             0x0
#define _B4EIDH_B4EID8_SIZE                                 0x1
#define _B4EIDH_B4EID8_LENGTH                               0x1
#define _B4EIDH_B4EID8_MASK                                 0x1
#define _B4EIDH_B4EID9_POSN                                 0x1
#define _B4EIDH_B4EID9_POSITION                             0x1
#define _B4EIDH_B4EID9_SIZE                                 0x1
#define _B4EIDH_B4EID9_LENGTH                               0x1
#define _B4EIDH_B4EID9_MASK                                 0x2
#define _B4EIDH_B4EID10_POSN                                0x2
#define _B4EIDH_B4EID10_POSITION                            0x2
#define _B4EIDH_B4EID10_SIZE                                0x1
#define _B4EIDH_B4EID10_LENGTH                              0x1
#define _B4EIDH_B4EID10_MASK                                0x4
#define _B4EIDH_B4EID11_POSN                                0x3
#define _B4EIDH_B4EID11_POSITION                            0x3
#define _B4EIDH_B4EID11_SIZE                                0x1
#define _B4EIDH_B4EID11_LENGTH                              0x1
#define _B4EIDH_B4EID11_MASK                                0x8
#define _B4EIDH_B4EID12_POSN                                0x4
#define _B4EIDH_B4EID12_POSITION                            0x4
#define _B4EIDH_B4EID12_SIZE                                0x1
#define _B4EIDH_B4EID12_LENGTH                              0x1
#define _B4EIDH_B4EID12_MASK                                0x10
#define _B4EIDH_B4EID13_POSN                                0x5
#define _B4EIDH_B4EID13_POSITION                            0x5
#define _B4EIDH_B4EID13_SIZE                                0x1
#define _B4EIDH_B4EID13_LENGTH                              0x1
#define _B4EIDH_B4EID13_MASK                                0x20
#define _B4EIDH_B4EID14_POSN                                0x6
#define _B4EIDH_B4EID14_POSITION                            0x6
#define _B4EIDH_B4EID14_SIZE                                0x1
#define _B4EIDH_B4EID14_LENGTH                              0x1
#define _B4EIDH_B4EID14_MASK                                0x40
#define _B4EIDH_B4EID15_POSN                                0x7
#define _B4EIDH_B4EID15_POSITION                            0x7
#define _B4EIDH_B4EID15_SIZE                                0x1
#define _B4EIDH_B4EID15_LENGTH                              0x1
#define _B4EIDH_B4EID15_MASK                                0x80

// Register: B4EIDL
#define B4EIDL B4EIDL
extern volatile unsigned char           B4EIDL              __at(0xE64);
#ifndef _LIB_BUILD
asm("B4EIDL equ 0E64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B4EID0                 :1;
        unsigned B4EID1                 :1;
        unsigned B4EID2                 :1;
        unsigned B4EID3                 :1;
        unsigned B4EID4                 :1;
        unsigned B4EID5                 :1;
        unsigned B4EID6                 :1;
        unsigned B4EID7                 :1;
    };
} B4EIDLbits_t;
